ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153fxx_cm4.h
/***************  Bit definition for DDRCTRL_ADDRMAP5 register  ***************/
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0_Pos    (0U)
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0_Msk    (0xFU << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0_Pos)    /*!< 0x0000000F */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0        DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0_Msk              /*!< Selects the HIF address bits used as row address bit 0. */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0_0      (0x1U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0_Pos)    /*!< 0x00000001 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0_1      (0x2U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0_Pos)    /*!< 0x00000002 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0_2      (0x4U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0_Pos)    /*!< 0x00000004 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0_3      (0x8U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B0_Pos)    /*!< 0x00000008 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1_Pos    (8U)
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1_Msk    (0xFU << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1_Pos)    /*!< 0x00000F00 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1        DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1_Msk              /*!< Selects the HIF address bits used as row address bit 1. */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1_0      (0x1U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1_Pos)    /*!< 0x00000100 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1_1      (0x2U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1_Pos)    /*!< 0x00000200 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1_2      (0x4U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1_Pos)    /*!< 0x00000400 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1_3      (0x8U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B1_Pos)    /*!< 0x00000800 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10_Pos (16U)
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10_Msk (0xFU << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10_Pos) /*!< 0x000F0000 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10     DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10_Msk           /*!< Selects the HIF address bits used as row address bits 2 to 10. */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10_0   (0x1U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10_Pos) /*!< 0x00010000 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10_1   (0x2U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10_Pos) /*!< 0x00020000 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10_2   (0x4U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10_Pos) /*!< 0x00040000 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10_3   (0x8U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B2_10_Pos) /*!< 0x00080000 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11_Pos   (24U)
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11_Msk   (0xFU << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11_Pos)   /*!< 0x0F000000 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11       DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11_Msk             /*!< Selects the HIF address bit used as row address bit 11. */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11_0     (0x1U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11_Pos)   /*!< 0x01000000 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11_1     (0x2U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11_Pos)   /*!< 0x02000000 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11_2     (0x4U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11_Pos)   /*!< 0x04000000 */
#define DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11_3     (0x8U << DDRCTRL_ADDRMAP5_ADDRMAP_ROW_B11_Pos)   /*!< 0x08000000 */

/***************  Bit definition for DDRCTRL_ADDRMAP6 register  ***************/
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12_Pos (0U)
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12_Msk (0xFU << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12_Pos) /*!< 0x0000000F */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12     DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12_Msk           /*!< Selects the HIF address bit used as row address bit 12. */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12_0   (0x1U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12_Pos) /*!< 0x00000001 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12_1   (0x2U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12_Pos) /*!< 0x00000002 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12_2   (0x4U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12_Pos) /*!< 0x00000004 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12_3   (0x8U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B12_Pos) /*!< 0x00000008 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13_Pos (8U)
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13_Msk (0xFU << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13_Pos) /*!< 0x00000F00 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13     DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13_Msk           /*!< Selects the HIF address bit used as row address bit 13. */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13_0   (0x1U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13_Pos) /*!< 0x00000100 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13_1   (0x2U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13_Pos) /*!< 0x00000200 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13_2   (0x4U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13_Pos) /*!< 0x00000400 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13_3   (0x8U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B13_Pos) /*!< 0x00000800 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14_Pos (16U)
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14_Msk (0xFU << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14_Pos) /*!< 0x000F0000 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14     DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14_Msk           /*!< Selects the HIF address bit used as row address bit 14. */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14_0   (0x1U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14_Pos) /*!< 0x00010000 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14_1   (0x2U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14_Pos) /*!< 0x00020000 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14_2   (0x4U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14_Pos) /*!< 0x00040000 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14_3   (0x8U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B14_Pos) /*!< 0x00080000 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15_Pos (24U)
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15_Msk (0xFU << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15_Pos) /*!< 0x0F000000 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15     DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15_Msk           /*!< Selects the HIF address bit used as row address bit 15. */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15_0   (0x1U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15_Pos) /*!< 0x01000000 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15_1   (0x2U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15_Pos) /*!< 0x02000000 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15_2   (0x4U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15_Pos) /*!< 0x04000000 */
#define DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15_3   (0x8U << DDRCTRL_ADDRMAP6_ADDRMAP_ROW_B15_Pos) /*!< 0x08000000 */
#define DDRCTRL_ADDRMAP6_LPDDR3_6GB_12GB_Pos (31U)
#define DDRCTRL_ADDRMAP6_LPDDR3_6GB_12GB_Msk (0x1U << DDRCTRL_ADDRMAP6_LPDDR3_6GB_12GB_Pos) /*!< 0x80000000 */
#define DDRCTRL_ADDRMAP6_LPDDR3_6GB_12GB     DDRCTRL_ADDRMAP6_LPDDR3_6GB_12GB_Msk           /*!< Set this to 1 if there is an LPDDR3 SDRAM 6Gb or 12Gb device in use. */

