ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153fxx_cm4.h
/***************  Bit definition for RCC_I2C46CKSELR register  ****************/
#define RCC_I2C46CKSELR_I2C46SRC_Pos              (0U)
#define RCC_I2C46CKSELR_I2C46SRC_Msk              (0x7U << RCC_I2C46CKSELR_I2C46SRC_Pos)             /*!< 0x00000007 */
#define RCC_I2C46CKSELR_I2C46SRC                  RCC_I2C46CKSELR_I2C46SRC_Msk                       /*!< I2C4 and I2C6 kernel clock source selection */
#define RCC_I2C46CKSELR_I2C46SRC_0                (0x1U << RCC_I2C46CKSELR_I2C46SRC_Pos)             /*!< 0x00000001 */
#define RCC_I2C46CKSELR_I2C46SRC_1                (0x2U << RCC_I2C46CKSELR_I2C46SRC_Pos)             /*!< 0x00000002 */
#define RCC_I2C46CKSELR_I2C46SRC_2                (0x4U << RCC_I2C46CKSELR_I2C46SRC_Pos)             /*!< 0x00000004 */

/****************  Bit definition for RCC_SPI6CKSELR register  ****************/
#define RCC_SPI6CKSELR_SPI6SRC_Pos                (0U)
#define RCC_SPI6CKSELR_SPI6SRC_Msk                (0x7U << RCC_SPI6CKSELR_SPI6SRC_Pos)               /*!< 0x00000007 */
#define RCC_SPI6CKSELR_SPI6SRC                    RCC_SPI6CKSELR_SPI6SRC_Msk                         /*!< SPI6 kernel clock source selection */
#define RCC_SPI6CKSELR_SPI6SRC_0                  (0x1U << RCC_SPI6CKSELR_SPI6SRC_Pos)               /*!< 0x00000001 */
#define RCC_SPI6CKSELR_SPI6SRC_1                  (0x2U << RCC_SPI6CKSELR_SPI6SRC_Pos)               /*!< 0x00000002 */
#define RCC_SPI6CKSELR_SPI6SRC_2                  (0x4U << RCC_SPI6CKSELR_SPI6SRC_Pos)               /*!< 0x00000004 */

/***************  Bit definition for RCC_UART1CKSELR register  ****************/
#define RCC_UART1CKSELR_UART1SRC_Pos              (0U)
#define RCC_UART1CKSELR_UART1SRC_Msk              (0x7U << RCC_UART1CKSELR_UART1SRC_Pos)             /*!< 0x00000007 */
#define RCC_UART1CKSELR_UART1SRC                  RCC_UART1CKSELR_UART1SRC_Msk                       /*!< UART1 kernel clock source selection */
#define RCC_UART1CKSELR_UART1SRC_0                (0x1U << RCC_UART1CKSELR_UART1SRC_Pos)             /*!< 0x00000001 */
#define RCC_UART1CKSELR_UART1SRC_1                (0x2U << RCC_UART1CKSELR_UART1SRC_Pos)             /*!< 0x00000002 */
#define RCC_UART1CKSELR_UART1SRC_2                (0x4U << RCC_UART1CKSELR_UART1SRC_Pos)             /*!< 0x00000004 */

/****************  Bit definition for RCC_RNG1CKSELR register  ****************/
#define RCC_RNG1CKSELR_RNG1SRC_Pos                (0U)
#define RCC_RNG1CKSELR_RNG1SRC_Msk                (0x3U << RCC_RNG1CKSELR_RNG1SRC_Pos)               /*!< 0x00000003 */
#define RCC_RNG1CKSELR_RNG1SRC                    RCC_RNG1CKSELR_RNG1SRC_Msk                         /*!< RNG1 kernel clock source selection */
#define RCC_RNG1CKSELR_RNG1SRC_0                  (0x1U << RCC_RNG1CKSELR_RNG1SRC_Pos)               /*!< 0x00000001 */
#define RCC_RNG1CKSELR_RNG1SRC_1                  (0x2U << RCC_RNG1CKSELR_RNG1SRC_Pos)               /*!< 0x00000002 */

/****************  Bit definition for RCC_CPERCKSELR register  ****************/
#define RCC_CPERCKSELR_CKPERSRC_Pos               (0U)
#define RCC_CPERCKSELR_CKPERSRC_Msk               (0x3U << RCC_CPERCKSELR_CKPERSRC_Pos)              /*!< 0x00000003 */
#define RCC_CPERCKSELR_CKPERSRC                   RCC_CPERCKSELR_CKPERSRC_Msk                        /*!< Oscillator selection for kernel clock */
#define RCC_CPERCKSELR_CKPERSRC_0                 (0x1U << RCC_CPERCKSELR_CKPERSRC_Pos)              /*!< 0x00000001 */
#define RCC_CPERCKSELR_CKPERSRC_1                 (0x2U << RCC_CPERCKSELR_CKPERSRC_Pos)              /*!< 0x00000002 */

/***************  Bit definition for RCC_STGENCKSELR register  ****************/
#define RCC_STGENCKSELR_STGENSRC_Pos              (0U)
#define RCC_STGENCKSELR_STGENSRC_Msk              (0x3U << RCC_STGENCKSELR_STGENSRC_Pos)             /*!< 0x00000003 */
#define RCC_STGENCKSELR_STGENSRC                  RCC_STGENCKSELR_STGENSRC_Msk                       /*!< Oscillator selection for kernel clock */
#define RCC_STGENCKSELR_STGENSRC_0                (0x1U << RCC_STGENCKSELR_STGENSRC_Pos)             /*!< 0x00000001 */
#define RCC_STGENCKSELR_STGENSRC_1                (0x2U << RCC_STGENCKSELR_STGENSRC_Pos)             /*!< 0x00000002 */

/*****************  Bit definition for RCC_DDRITFCR register  *****************/
#define RCC_DDRITFCR_DDRC1EN_Pos                  (0U)
#define RCC_DDRITFCR_DDRC1EN_Msk                  (0x1U << RCC_DDRITFCR_DDRC1EN_Pos)                 /*!< 0x00000001 */
#define RCC_DDRITFCR_DDRC1EN                      RCC_DDRITFCR_DDRC1EN_Msk                           /*!< DDRC port 1 peripheral clocks enable */
#define RCC_DDRITFCR_DDRC1LPEN_Pos                (1U)
#define RCC_DDRITFCR_DDRC1LPEN_Msk                (0x1U << RCC_DDRITFCR_DDRC1LPEN_Pos)               /*!< 0x00000002 */
#define RCC_DDRITFCR_DDRC1LPEN                    RCC_DDRITFCR_DDRC1LPEN_Msk                         /*!< DDRC port 1 peripheral clocks enable during CSleep mode */
#define RCC_DDRITFCR_DDRC2EN_Pos                  (2U)
#define RCC_DDRITFCR_DDRC2EN_Msk                  (0x1U << RCC_DDRITFCR_DDRC2EN_Pos)                 /*!< 0x00000004 */
#define RCC_DDRITFCR_DDRC2EN                      RCC_DDRITFCR_DDRC2EN_Msk                           /*!< DDRC port 2 peripheral clocks enable */
#define RCC_DDRITFCR_DDRC2LPEN_Pos                (3U)
#define RCC_DDRITFCR_DDRC2LPEN_Msk                (0x1U << RCC_DDRITFCR_DDRC2LPEN_Pos)               /*!< 0x00000008 */
#define RCC_DDRITFCR_DDRC2LPEN                    RCC_DDRITFCR_DDRC2LPEN_Msk                         /*!< DDRC port 2 peripheral clocks enable during CSleep mode */
#define RCC_DDRITFCR_DDRPHYCEN_Pos                (4U)
#define RCC_DDRITFCR_DDRPHYCEN_Msk                (0x1U << RCC_DDRITFCR_DDRPHYCEN_Pos)               /*!< 0x00000010 */
#define RCC_DDRITFCR_DDRPHYCEN                    RCC_DDRITFCR_DDRPHYCEN_Msk                         /*!< DDRPHYC peripheral clocks enable */
#define RCC_DDRITFCR_DDRPHYCLPEN_Pos              (5U)
#define RCC_DDRITFCR_DDRPHYCLPEN_Msk              (0x1U << RCC_DDRITFCR_DDRPHYCLPEN_Pos)             /*!< 0x00000020 */
#define RCC_DDRITFCR_DDRPHYCLPEN                  RCC_DDRITFCR_DDRPHYCLPEN_Msk                       /*!< DDRPHYC peripheral clocks enable during CSleep mode */
#define RCC_DDRITFCR_DDRCAPBEN_Pos                (6U)
#define RCC_DDRITFCR_DDRCAPBEN_Msk                (0x1U << RCC_DDRITFCR_DDRCAPBEN_Pos)               /*!< 0x00000040 */
#define RCC_DDRITFCR_DDRCAPBEN                    RCC_DDRITFCR_DDRCAPBEN_Msk                         /*!< DDRC APB clock enable */
#define RCC_DDRITFCR_DDRCAPBLPEN_Pos              (7U)
#define RCC_DDRITFCR_DDRCAPBLPEN_Msk              (0x1U << RCC_DDRITFCR_DDRCAPBLPEN_Pos)             /*!< 0x00000080 */
#define RCC_DDRITFCR_DDRCAPBLPEN                  RCC_DDRITFCR_DDRCAPBLPEN_Msk                       /*!< DDRC APB clock enable during CSleep mode */
#define RCC_DDRITFCR_AXIDCGEN_Pos                 (8U)
#define RCC_DDRITFCR_AXIDCGEN_Msk                 (0x1U << RCC_DDRITFCR_AXIDCGEN_Pos)                /*!< 0x00000100 */
#define RCC_DDRITFCR_AXIDCGEN                     RCC_DDRITFCR_AXIDCGEN_Msk                          /*!< AXIDCG enable during MPU CRun mode */
#define RCC_DDRITFCR_DDRPHYCAPBEN_Pos             (9U)
#define RCC_DDRITFCR_DDRPHYCAPBEN_Msk             (0x1U << RCC_DDRITFCR_DDRPHYCAPBEN_Pos)            /*!< 0x00000200 */
#define RCC_DDRITFCR_DDRPHYCAPBEN                 RCC_DDRITFCR_DDRPHYCAPBEN_Msk                      /*!< DDRPHYC APB clock enable */
#define RCC_DDRITFCR_DDRPHYCAPBLPEN_Pos           (10U)
#define RCC_DDRITFCR_DDRPHYCAPBLPEN_Msk           (0x1U << RCC_DDRITFCR_DDRPHYCAPBLPEN_Pos)          /*!< 0x00000400 */
#define RCC_DDRITFCR_DDRPHYCAPBLPEN               RCC_DDRITFCR_DDRPHYCAPBLPEN_Msk                    /*!< DDRPHYC APB clock enable during CSleep mode */
#define RCC_DDRITFCR_KERDCG_DLY_Pos               (11U)
#define RCC_DDRITFCR_KERDCG_DLY_Msk               (0x7U << RCC_DDRITFCR_KERDCG_DLY_Pos)              /*!< 0x00003800 */
#define RCC_DDRITFCR_KERDCG_DLY                   RCC_DDRITFCR_KERDCG_DLY_Msk                        /*!< AXIDCG delay */
#define RCC_DDRITFCR_KERDCG_DLY_0                 (0x1U << RCC_DDRITFCR_KERDCG_DLY_Pos)            /*!< 0x00000800 */
#define RCC_DDRITFCR_KERDCG_DLY_1                 (0x2U << RCC_DDRITFCR_KERDCG_DLY_Pos)           /*!< 0x00001000 */
#define RCC_DDRITFCR_KERDCG_DLY_2                 (0x4U << RCC_DDRITFCR_KERDCG_DLY_Pos)           /*!< 0x00002000 */
#define RCC_DDRITFCR_DDRCAPBRST_Pos               (14U)
#define RCC_DDRITFCR_DDRCAPBRST_Msk               (0x1U << RCC_DDRITFCR_DDRCAPBRST_Pos)              /*!< 0x00004000 */
#define RCC_DDRITFCR_DDRCAPBRST                   RCC_DDRITFCR_DDRCAPBRST_Msk                        /*!< DDRC APB interface reset */
#define RCC_DDRITFCR_DDRCAXIRST_Pos               (15U)
#define RCC_DDRITFCR_DDRCAXIRST_Msk               (0x1U << RCC_DDRITFCR_DDRCAXIRST_Pos)              /*!< 0x00008000 */
#define RCC_DDRITFCR_DDRCAXIRST                   RCC_DDRITFCR_DDRCAXIRST_Msk                        /*!< DDRC AXI interface reset */
#define RCC_DDRITFCR_DDRCORERST_Pos               (16U)
#define RCC_DDRITFCR_DDRCORERST_Msk               (0x1U << RCC_DDRITFCR_DDRCORERST_Pos)              /*!< 0x00010000 */
#define RCC_DDRITFCR_DDRCORERST                   RCC_DDRITFCR_DDRCORERST_Msk                        /*!< DDRC core reset */
#define RCC_DDRITFCR_DPHYAPBRST_Pos               (17U)
#define RCC_DDRITFCR_DPHYAPBRST_Msk               (0x1U << RCC_DDRITFCR_DPHYAPBRST_Pos)              /*!< 0x00020000 */
#define RCC_DDRITFCR_DPHYAPBRST                   RCC_DDRITFCR_DPHYAPBRST_Msk                        /*!< DDRPHYC APB interface reset */
#define RCC_DDRITFCR_DPHYRST_Pos                  (18U)
#define RCC_DDRITFCR_DPHYRST_Msk                  (0x1U << RCC_DDRITFCR_DPHYRST_Pos)                 /*!< 0x00040000 */
#define RCC_DDRITFCR_DPHYRST                      RCC_DDRITFCR_DPHYRST_Msk                           /*!< DDRPHYC reset */
#define RCC_DDRITFCR_DPHYCTLRST_Pos               (19U)
#define RCC_DDRITFCR_DPHYCTLRST_Msk               (0x1U << RCC_DDRITFCR_DPHYCTLRST_Pos)              /*!< 0x00080000 */
#define RCC_DDRITFCR_DPHYCTLRST                   RCC_DDRITFCR_DPHYCTLRST_Msk                        /*!< DDRPHYC Control reset */
#define RCC_DDRITFCR_DDRCKMOD_Pos                 (20U)
#define RCC_DDRITFCR_DDRCKMOD_Msk                 (0x7U << RCC_DDRITFCR_DDRCKMOD_Pos)                /*!< 0x00700000 */
#define RCC_DDRITFCR_DDRCKMOD                     RCC_DDRITFCR_DDRCKMOD_Msk                          /*!< RCC mode for DDR clock control */
#define RCC_DDRITFCR_DDRCKMOD_0                   (0x1U << RCC_DDRITFCR_DDRCKMOD_Pos)           /*!< 0x00100000 */
#define RCC_DDRITFCR_DDRCKMOD_1                   (0x2U << RCC_DDRITFCR_DDRCKMOD_Pos)           /*!< 0x00200000 */
#define RCC_DDRITFCR_DDRCKMOD_2                   (0x4U << RCC_DDRITFCR_DDRCKMOD_Pos)           /*!< 0x00400000 */
#define RCC_DDRITFCR_GSKPMOD_Pos                  (23U)
#define RCC_DDRITFCR_GSKPMOD_Msk                  (0x1U << RCC_DDRITFCR_GSKPMOD_Pos)                 /*!< 0x00800000 */
#define RCC_DDRITFCR_GSKPMOD                      RCC_DDRITFCR_GSKPMOD_Msk                           /*!< Glitch Skipper (GSKP) Mode */
#define RCC_DDRITFCR_GSKPCTRL_Pos                 (24U)
#define RCC_DDRITFCR_GSKPCTRL_Msk                 (0x1U << RCC_DDRITFCR_GSKPCTRL_Pos)                /*!< 0x01000000 */
#define RCC_DDRITFCR_GSKPCTRL                     RCC_DDRITFCR_GSKPCTRL_Msk                          /*!< Glitch Skipper (GSKP) control */
#define RCC_DDRITFCR_DFILP_WIDTH_Pos              (25U)
#define RCC_DDRITFCR_DFILP_WIDTH_Msk              (0x7U << RCC_DDRITFCR_DFILP_WIDTH_Pos)             /*!< 0x0E000000 */
#define RCC_DDRITFCR_DFILP_WIDTH                  RCC_DDRITFCR_DFILP_WIDTH_Msk                       /*!< Minimum duration of low-power request command */
#define RCC_DDRITFCR_DFILP_WIDTH_0                (0x1U << RCC_DDRITFCR_DFILP_WIDTH_Pos)       /*!< 0x02000000 */
#define RCC_DDRITFCR_DFILP_WIDTH_1                (0x2U << RCC_DDRITFCR_DFILP_WIDTH_Pos)       /*!< 0x04000000 */
#define RCC_DDRITFCR_DFILP_WIDTH_2                (0x4U << RCC_DDRITFCR_DFILP_WIDTH_Pos)       /*!< 0x08000000 */
#define RCC_DDRITFCR_GSKP_DUR_Pos                 (28U)
#define RCC_DDRITFCR_GSKP_DUR_Msk                 (0xFU << RCC_DDRITFCR_GSKP_DUR_Pos)                /*!< 0xF0000000 */
#define RCC_DDRITFCR_GSKP_DUR                     RCC_DDRITFCR_GSKP_DUR_Msk                          /*!< Glitch skipper duration in automatic mode */
#define RCC_DDRITFCR_GSKP_DUR_0                   (0x1U << RCC_DDRITFCR_GSKP_DUR_Pos)         /*!< 0x10000000 */
#define RCC_DDRITFCR_GSKP_DUR_1                   (0x2U << RCC_DDRITFCR_GSKP_DUR_Pos)         /*!< 0x20000000 */
#define RCC_DDRITFCR_GSKP_DUR_2                   (0x4U << RCC_DDRITFCR_GSKP_DUR_Pos)         /*!< 0x40000000 */
#define RCC_DDRITFCR_GSKP_DUR_3                   (0x8U << RCC_DDRITFCR_GSKP_DUR_Pos)         /*!< 0x80000000 */

/****************  Bit definition for RCC_MP_BOOTCR register  *****************/
#define RCC_MP_BOOTCR_MCU_BEN_Pos                 (0U)
#define RCC_MP_BOOTCR_MCU_BEN_Msk                 (0x1U << RCC_MP_BOOTCR_MCU_BEN_Pos)                /*!< 0x00000001 */
#define RCC_MP_BOOTCR_MCU_BEN                     RCC_MP_BOOTCR_MCU_BEN_Msk                          /*!< MCU Boot Enable after Standby */
#define RCC_MP_BOOTCR_MPU_BEN_Pos                 (1U)
#define RCC_MP_BOOTCR_MPU_BEN_Msk                 (0x1U << RCC_MP_BOOTCR_MPU_BEN_Pos)                /*!< 0x00000002 */
#define RCC_MP_BOOTCR_MPU_BEN                     RCC_MP_BOOTCR_MPU_BEN_Msk                          /*!< MPU Boot Enable after Standby */

/***************  Bit definition for RCC_MP_SREQSETR register  ****************/
#define RCC_MP_SREQSETR_STPREQ_P0_Pos             (0U)
#define RCC_MP_SREQSETR_STPREQ_P0_Msk             (0x1U << RCC_MP_SREQSETR_STPREQ_P0_Pos)            /*!< 0x00000001 */
#define RCC_MP_SREQSETR_STPREQ_P0                 RCC_MP_SREQSETR_STPREQ_P0_Msk                      /*!< Stop Request for MPU processor number 0 */
#define RCC_MP_SREQSETR_STPREQ_P1_Pos             (1U)
#define RCC_MP_SREQSETR_STPREQ_P1_Msk             (0x1U << RCC_MP_SREQSETR_STPREQ_P1_Pos)            /*!< 0x00000002 */
#define RCC_MP_SREQSETR_STPREQ_P1                 RCC_MP_SREQSETR_STPREQ_P1_Msk                      /*!< Stop Request for MPU processor number 1 */

/***************  Bit definition for RCC_MP_SREQCLRR register  ****************/
#define RCC_MP_SREQCLRR_STPREQ_P0_Pos             (0U)
#define RCC_MP_SREQCLRR_STPREQ_P0_Msk             (0x1U << RCC_MP_SREQCLRR_STPREQ_P0_Pos)            /*!< 0x00000001 */
#define RCC_MP_SREQCLRR_STPREQ_P0                 RCC_MP_SREQCLRR_STPREQ_P0_Msk                      /*!< Stop Request for MPU processor number 0 */
#define RCC_MP_SREQCLRR_STPREQ_P1_Pos             (1U)
#define RCC_MP_SREQCLRR_STPREQ_P1_Msk             (0x1U << RCC_MP_SREQCLRR_STPREQ_P1_Pos)            /*!< 0x00000002 */
#define RCC_MP_SREQCLRR_STPREQ_P1                 RCC_MP_SREQCLRR_STPREQ_P1_Msk                      /*!< Stop Request for MPU processor number 1 */

/******************  Bit definition for RCC_MP_GCR register  ******************/
#define RCC_MP_GCR_BOOT_MCU_Pos                   (0U)
#define RCC_MP_GCR_BOOT_MCU_Msk                   (0x1U << RCC_MP_GCR_BOOT_MCU_Pos)                  /*!< 0x00000001 */
#define RCC_MP_GCR_BOOT_MCU                       RCC_MP_GCR_BOOT_MCU_Msk                            /*!< Allows the MCU to boot */

/****************  Bit definition for RCC_MP_APRSTCR register  ****************/
#define RCC_MP_APRSTCR_RDCTLEN_Pos                (0U)
#define RCC_MP_APRSTCR_RDCTLEN_Msk                (0x1U << RCC_MP_APRSTCR_RDCTLEN_Pos)               /*!< 0x00000001 */
#define RCC_MP_APRSTCR_RDCTLEN                    RCC_MP_APRSTCR_RDCTLEN_Msk                         /*!< Reset Delay Control Enable */
#define RCC_MP_APRSTCR_RSTTO_Pos                  (8U)
#define RCC_MP_APRSTCR_RSTTO_Msk                  (0x7FU << RCC_MP_APRSTCR_RSTTO_Pos)                /*!< 0x00007F00 */
#define RCC_MP_APRSTCR_RSTTO                      RCC_MP_APRSTCR_RSTTO_Msk                           /*!< Reset Timeout Delay Adjust */
#define RCC_MP_APRSTCR_RSTTO_0                    (0x1U << RCC_MP_APRSTCR_RSTTO_Pos)               /*!< 0x00000100 */
#define RCC_MP_APRSTCR_RSTTO_1                    (0x2U << RCC_MP_APRSTCR_RSTTO_Pos)               /*!< 0x00000200 */
#define RCC_MP_APRSTCR_RSTTO_2                    (0x4U << RCC_MP_APRSTCR_RSTTO_Pos)               /*!< 0x00000400 */
#define RCC_MP_APRSTCR_RSTTO_3                    (0x8U << RCC_MP_APRSTCR_RSTTO_Pos)               /*!< 0x00000800 */
#define RCC_MP_APRSTCR_RSTTO_4                    (0x10U << RCC_MP_APRSTCR_RSTTO_Pos)              /*!< 0x00001000 */
#define RCC_MP_APRSTCR_RSTTO_5                    (0x20U << RCC_MP_APRSTCR_RSTTO_Pos)              /*!< 0x00002000 */
#define RCC_MP_APRSTCR_RSTTO_6                    (0x40U << RCC_MP_APRSTCR_RSTTO_Pos)              /*!< 0x00004000 */

/****************  Bit definition for RCC_MP_APRSTSR register  ****************/
#define RCC_MP_APRSTSR_RSTTOV_Pos                 (8U)
#define RCC_MP_APRSTSR_RSTTOV_Msk                 (0x7FU << RCC_MP_APRSTSR_RSTTOV_Pos)               /*!< 0x00007F00 */
#define RCC_MP_APRSTSR_RSTTOV                     RCC_MP_APRSTSR_RSTTOV_Msk                          /*!< Reset Timeout Delay Value */
#define RCC_MP_APRSTSR_RSTTOV_0                   (0x1U << RCC_MP_APRSTSR_RSTTOV_Pos)              /*!< 0x00000100 */
#define RCC_MP_APRSTSR_RSTTOV_1                   (0x2U << RCC_MP_APRSTSR_RSTTOV_Pos)              /*!< 0x00000200 */
#define RCC_MP_APRSTSR_RSTTOV_2                   (0x4U << RCC_MP_APRSTSR_RSTTOV_Pos)              /*!< 0x00000400 */
#define RCC_MP_APRSTSR_RSTTOV_3                   (0x8U << RCC_MP_APRSTSR_RSTTOV_Pos)              /*!< 0x00000800 */
#define RCC_MP_APRSTSR_RSTTOV_4                   (0x10U << RCC_MP_APRSTSR_RSTTOV_Pos)             /*!< 0x00001000 */
#define RCC_MP_APRSTSR_RSTTOV_5                   (0x20U << RCC_MP_APRSTSR_RSTTOV_Pos)             /*!< 0x00002000 */
#define RCC_MP_APRSTSR_RSTTOV_6                   (0x40U << RCC_MP_APRSTSR_RSTTOV_Pos)             /*!< 0x00004000 */

/*******************  Bit definition for RCC_BDCR register  *******************/
#define RCC_BDCR_LSEON_Pos                        (0U)
#define RCC_BDCR_LSEON_Msk                        (0x1U << RCC_BDCR_LSEON_Pos)                       /*!< 0x00000001 */
#define RCC_BDCR_LSEON                            RCC_BDCR_LSEON_Msk                                 /*!< LSE oscillator enabled */
#define RCC_BDCR_LSEBYP_Pos                       (1U)
#define RCC_BDCR_LSEBYP_Msk                       (0x1U << RCC_BDCR_LSEBYP_Pos)                      /*!< 0x00000002 */
#define RCC_BDCR_LSEBYP                           RCC_BDCR_LSEBYP_Msk                                /*!< LSE oscillator bypass */
#define RCC_BDCR_LSERDY_Pos                       (2U)
#define RCC_BDCR_LSERDY_Msk                       (0x1U << RCC_BDCR_LSERDY_Pos)                      /*!< 0x00000004 */
#define RCC_BDCR_LSERDY                           RCC_BDCR_LSERDY_Msk                                /*!< LSE oscillator ready */
#define RCC_BDCR_DIGBYP_Pos                       (3U)
#define RCC_BDCR_DIGBYP_Msk                       (0x1U << RCC_BDCR_DIGBYP_Pos)                      /*!< 0x00000008 */
#define RCC_BDCR_DIGBYP                           RCC_BDCR_DIGBYP_Msk                                /*!< LSE digital bypass */
#define RCC_BDCR_LSEDRV_Pos                       (4U)
#define RCC_BDCR_LSEDRV_Msk                       (0x3U << RCC_BDCR_LSEDRV_Pos)                      /*!< 0x00000030 */
#define RCC_BDCR_LSEDRV                           RCC_BDCR_LSEDRV_Msk                                /*!< LSE oscillator driving capability */
#define RCC_BDCR_LSEDRV_0                         (0x1U << RCC_BDCR_LSEDRV_Pos)                     /*!< 0x00000010 */
#define RCC_BDCR_LSEDRV_1                         (0x2U << RCC_BDCR_LSEDRV_Pos)                     /*!< 0x00000020 */
#define RCC_BDCR_LSECSSON_Pos                     (8U)
#define RCC_BDCR_LSECSSON_Msk                     (0x1U << RCC_BDCR_LSECSSON_Pos)                    /*!< 0x00000100 */
#define RCC_BDCR_LSECSSON                         RCC_BDCR_LSECSSON_Msk                              /*!< LSE clock security system enable */
#define RCC_BDCR_LSECSSD_Pos                      (9U)
#define RCC_BDCR_LSECSSD_Msk                      (0x1U << RCC_BDCR_LSECSSD_Pos)                     /*!< 0x00000200 */
#define RCC_BDCR_LSECSSD                          RCC_BDCR_LSECSSD_Msk                               /*!< LSE clock security system failure detection */
#define RCC_BDCR_RTCSRC_Pos                       (16U)
#define RCC_BDCR_RTCSRC_Msk                       (0x3U << RCC_BDCR_RTCSRC_Pos)                      /*!< 0x00030000 */
#define RCC_BDCR_RTCSRC                           RCC_BDCR_RTCSRC_Msk                                /*!< RTC clock source selection */
#define RCC_BDCR_RTCSRC_0                         (0x1U << RCC_BDCR_RTCSRC_Pos)                  /*!< 0x00010000 */
#define RCC_BDCR_RTCSRC_1                         (0x2U << RCC_BDCR_RTCSRC_Pos)                  /*!< 0x00020000 */
#define RCC_BDCR_RTCCKEN_Pos                      (20U)
#define RCC_BDCR_RTCCKEN_Msk                      (0x1U << RCC_BDCR_RTCCKEN_Pos)                     /*!< 0x00100000 */
#define RCC_BDCR_RTCCKEN                          RCC_BDCR_RTCCKEN_Msk                               /*!< RTC clock enable */
#define RCC_BDCR_VSWRST_Pos                       (31U)
#define RCC_BDCR_VSWRST_Msk                       (0x1U << RCC_BDCR_VSWRST_Pos)                      /*!< 0x80000000 */
#define RCC_BDCR_VSWRST                           RCC_BDCR_VSWRST_Msk                                /*!< V Switch domain software reset */

