ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153fxx_cm4.h
/***************  Bit definition for RCC_APB1RSTCLRR register  ****************/
#define RCC_APB1RSTCLRR_TIM2RST_Pos               (0U)
#define RCC_APB1RSTCLRR_TIM2RST_Msk               (0x1U << RCC_APB1RSTCLRR_TIM2RST_Pos)              /*!< 0x00000001 */
#define RCC_APB1RSTCLRR_TIM2RST                   RCC_APB1RSTCLRR_TIM2RST_Msk                        /*!< TIM2 block reset */
#define RCC_APB1RSTCLRR_TIM3RST_Pos               (1U)
#define RCC_APB1RSTCLRR_TIM3RST_Msk               (0x1U << RCC_APB1RSTCLRR_TIM3RST_Pos)              /*!< 0x00000002 */
#define RCC_APB1RSTCLRR_TIM3RST                   RCC_APB1RSTCLRR_TIM3RST_Msk                        /*!< TIM3 block reset */
#define RCC_APB1RSTCLRR_TIM4RST_Pos               (2U)
#define RCC_APB1RSTCLRR_TIM4RST_Msk               (0x1U << RCC_APB1RSTCLRR_TIM4RST_Pos)              /*!< 0x00000004 */
#define RCC_APB1RSTCLRR_TIM4RST                   RCC_APB1RSTCLRR_TIM4RST_Msk                        /*!< TIM4 block reset */
#define RCC_APB1RSTCLRR_TIM5RST_Pos               (3U)
#define RCC_APB1RSTCLRR_TIM5RST_Msk               (0x1U << RCC_APB1RSTCLRR_TIM5RST_Pos)              /*!< 0x00000008 */
#define RCC_APB1RSTCLRR_TIM5RST                   RCC_APB1RSTCLRR_TIM5RST_Msk                        /*!< TIM5 block reset */
#define RCC_APB1RSTCLRR_TIM6RST_Pos               (4U)
#define RCC_APB1RSTCLRR_TIM6RST_Msk               (0x1U << RCC_APB1RSTCLRR_TIM6RST_Pos)              /*!< 0x00000010 */
#define RCC_APB1RSTCLRR_TIM6RST                   RCC_APB1RSTCLRR_TIM6RST_Msk                        /*!< TIM6 block reset */
#define RCC_APB1RSTCLRR_TIM7RST_Pos               (5U)
#define RCC_APB1RSTCLRR_TIM7RST_Msk               (0x1U << RCC_APB1RSTCLRR_TIM7RST_Pos)              /*!< 0x00000020 */
#define RCC_APB1RSTCLRR_TIM7RST                   RCC_APB1RSTCLRR_TIM7RST_Msk                        /*!< TIM7 block reset */
#define RCC_APB1RSTCLRR_TIM12RST_Pos              (6U)
#define RCC_APB1RSTCLRR_TIM12RST_Msk              (0x1U << RCC_APB1RSTCLRR_TIM12RST_Pos)             /*!< 0x00000040 */
#define RCC_APB1RSTCLRR_TIM12RST                  RCC_APB1RSTCLRR_TIM12RST_Msk                       /*!< TIM12 block reset */
#define RCC_APB1RSTCLRR_TIM13RST_Pos              (7U)
#define RCC_APB1RSTCLRR_TIM13RST_Msk              (0x1U << RCC_APB1RSTCLRR_TIM13RST_Pos)             /*!< 0x00000080 */
#define RCC_APB1RSTCLRR_TIM13RST                  RCC_APB1RSTCLRR_TIM13RST_Msk                       /*!< TIM13 block reset */
#define RCC_APB1RSTCLRR_TIM14RST_Pos              (8U)
#define RCC_APB1RSTCLRR_TIM14RST_Msk              (0x1U << RCC_APB1RSTCLRR_TIM14RST_Pos)             /*!< 0x00000100 */
#define RCC_APB1RSTCLRR_TIM14RST                  RCC_APB1RSTCLRR_TIM14RST_Msk                       /*!< TIM14 block reset */
#define RCC_APB1RSTCLRR_LPTIM1RST_Pos             (9U)
#define RCC_APB1RSTCLRR_LPTIM1RST_Msk             (0x1U << RCC_APB1RSTCLRR_LPTIM1RST_Pos)            /*!< 0x00000200 */
#define RCC_APB1RSTCLRR_LPTIM1RST                 RCC_APB1RSTCLRR_LPTIM1RST_Msk                      /*!< LPTIM1 block reset */
#define RCC_APB1RSTCLRR_SPI2RST_Pos               (11U)
#define RCC_APB1RSTCLRR_SPI2RST_Msk               (0x1U << RCC_APB1RSTCLRR_SPI2RST_Pos)              /*!< 0x00000800 */
#define RCC_APB1RSTCLRR_SPI2RST                   RCC_APB1RSTCLRR_SPI2RST_Msk                        /*!< SPI2 block reset */
#define RCC_APB1RSTCLRR_SPI3RST_Pos               (12U)
#define RCC_APB1RSTCLRR_SPI3RST_Msk               (0x1U << RCC_APB1RSTCLRR_SPI3RST_Pos)              /*!< 0x00001000 */
#define RCC_APB1RSTCLRR_SPI3RST                   RCC_APB1RSTCLRR_SPI3RST_Msk                        /*!< SPI3 block reset */
#define RCC_APB1RSTCLRR_USART2RST_Pos             (14U)
#define RCC_APB1RSTCLRR_USART2RST_Msk             (0x1U << RCC_APB1RSTCLRR_USART2RST_Pos)            /*!< 0x00004000 */
#define RCC_APB1RSTCLRR_USART2RST                 RCC_APB1RSTCLRR_USART2RST_Msk                      /*!< USART2 block reset */
#define RCC_APB1RSTCLRR_USART3RST_Pos             (15U)
#define RCC_APB1RSTCLRR_USART3RST_Msk             (0x1U << RCC_APB1RSTCLRR_USART3RST_Pos)            /*!< 0x00008000 */
#define RCC_APB1RSTCLRR_USART3RST                 RCC_APB1RSTCLRR_USART3RST_Msk                      /*!< USART3 block reset */
#define RCC_APB1RSTCLRR_UART4RST_Pos              (16U)
#define RCC_APB1RSTCLRR_UART4RST_Msk              (0x1U << RCC_APB1RSTCLRR_UART4RST_Pos)             /*!< 0x00010000 */
#define RCC_APB1RSTCLRR_UART4RST                  RCC_APB1RSTCLRR_UART4RST_Msk                       /*!< UART4 block reset */
#define RCC_APB1RSTCLRR_UART5RST_Pos              (17U)
#define RCC_APB1RSTCLRR_UART5RST_Msk              (0x1U << RCC_APB1RSTCLRR_UART5RST_Pos)             /*!< 0x00020000 */
#define RCC_APB1RSTCLRR_UART5RST                  RCC_APB1RSTCLRR_UART5RST_Msk                       /*!< UART5 block reset */
#define RCC_APB1RSTCLRR_UART7RST_Pos              (18U)
#define RCC_APB1RSTCLRR_UART7RST_Msk              (0x1U << RCC_APB1RSTCLRR_UART7RST_Pos)             /*!< 0x00040000 */
#define RCC_APB1RSTCLRR_UART7RST                  RCC_APB1RSTCLRR_UART7RST_Msk                       /*!< UART7 block reset */
#define RCC_APB1RSTCLRR_UART8RST_Pos              (19U)
#define RCC_APB1RSTCLRR_UART8RST_Msk              (0x1U << RCC_APB1RSTCLRR_UART8RST_Pos)             /*!< 0x00080000 */
#define RCC_APB1RSTCLRR_UART8RST                  RCC_APB1RSTCLRR_UART8RST_Msk                       /*!< UART8 block reset */
#define RCC_APB1RSTCLRR_I2C1RST_Pos               (21U)
#define RCC_APB1RSTCLRR_I2C1RST_Msk               (0x1U << RCC_APB1RSTCLRR_I2C1RST_Pos)              /*!< 0x00200000 */
#define RCC_APB1RSTCLRR_I2C1RST                   RCC_APB1RSTCLRR_I2C1RST_Msk                        /*!< I2C1 block reset */
#define RCC_APB1RSTCLRR_I2C2RST_Pos               (22U)
#define RCC_APB1RSTCLRR_I2C2RST_Msk               (0x1U << RCC_APB1RSTCLRR_I2C2RST_Pos)              /*!< 0x00400000 */
#define RCC_APB1RSTCLRR_I2C2RST                   RCC_APB1RSTCLRR_I2C2RST_Msk                        /*!< I2C2 block reset */
#define RCC_APB1RSTCLRR_I2C3RST_Pos               (23U)
#define RCC_APB1RSTCLRR_I2C3RST_Msk               (0x1U << RCC_APB1RSTCLRR_I2C3RST_Pos)              /*!< 0x00800000 */
#define RCC_APB1RSTCLRR_I2C3RST                   RCC_APB1RSTCLRR_I2C3RST_Msk                        /*!< I2C3 block reset */
#define RCC_APB1RSTCLRR_I2C5RST_Pos               (24U)
#define RCC_APB1RSTCLRR_I2C5RST_Msk               (0x1U << RCC_APB1RSTCLRR_I2C5RST_Pos)              /*!< 0x01000000 */
#define RCC_APB1RSTCLRR_I2C5RST                   RCC_APB1RSTCLRR_I2C5RST_Msk                        /*!< I2C5 block reset */
#define RCC_APB1RSTCLRR_SPDIFRST_Pos              (26U)
#define RCC_APB1RSTCLRR_SPDIFRST_Msk              (0x1U << RCC_APB1RSTCLRR_SPDIFRST_Pos)             /*!< 0x04000000 */
#define RCC_APB1RSTCLRR_SPDIFRST                  RCC_APB1RSTCLRR_SPDIFRST_Msk                       /*!< SPDIFRX block reset */
#define RCC_APB1RSTCLRR_CECRST_Pos                (27U)
#define RCC_APB1RSTCLRR_CECRST_Msk                (0x1U << RCC_APB1RSTCLRR_CECRST_Pos)               /*!< 0x08000000 */
#define RCC_APB1RSTCLRR_CECRST                    RCC_APB1RSTCLRR_CECRST_Msk                         /*!< HDMI-CEC block reset */
#define RCC_APB1RSTCLRR_DAC12RST_Pos              (29U)
#define RCC_APB1RSTCLRR_DAC12RST_Msk              (0x1U << RCC_APB1RSTCLRR_DAC12RST_Pos)             /*!< 0x20000000 */
#define RCC_APB1RSTCLRR_DAC12RST                  RCC_APB1RSTCLRR_DAC12RST_Msk                       /*!< DAC1&amp;2 block reset */
#define RCC_APB1RSTCLRR_MDIOSRST_Pos              (31U)
#define RCC_APB1RSTCLRR_MDIOSRST_Msk              (0x1U << RCC_APB1RSTCLRR_MDIOSRST_Pos)             /*!< 0x80000000 */
#define RCC_APB1RSTCLRR_MDIOSRST                  RCC_APB1RSTCLRR_MDIOSRST_Msk                       /*!< MDIOS block reset */

/***************  Bit definition for RCC_APB2RSTSETR register  ****************/
#define RCC_APB2RSTSETR_TIM1RST_Pos               (0U)
#define RCC_APB2RSTSETR_TIM1RST_Msk               (0x1U << RCC_APB2RSTSETR_TIM1RST_Pos)              /*!< 0x00000001 */
#define RCC_APB2RSTSETR_TIM1RST                   RCC_APB2RSTSETR_TIM1RST_Msk                        /*!< TIM1 block reset */
#define RCC_APB2RSTSETR_TIM8RST_Pos               (1U)
#define RCC_APB2RSTSETR_TIM8RST_Msk               (0x1U << RCC_APB2RSTSETR_TIM8RST_Pos)              /*!< 0x00000002 */
#define RCC_APB2RSTSETR_TIM8RST                   RCC_APB2RSTSETR_TIM8RST_Msk                        /*!< TIM8 block reset */
#define RCC_APB2RSTSETR_TIM15RST_Pos              (2U)
#define RCC_APB2RSTSETR_TIM15RST_Msk              (0x1U << RCC_APB2RSTSETR_TIM15RST_Pos)             /*!< 0x00000004 */
#define RCC_APB2RSTSETR_TIM15RST                  RCC_APB2RSTSETR_TIM15RST_Msk                       /*!< TIM15 block reset */
#define RCC_APB2RSTSETR_TIM16RST_Pos              (3U)
#define RCC_APB2RSTSETR_TIM16RST_Msk              (0x1U << RCC_APB2RSTSETR_TIM16RST_Pos)             /*!< 0x00000008 */
#define RCC_APB2RSTSETR_TIM16RST                  RCC_APB2RSTSETR_TIM16RST_Msk                       /*!< TIM16 block reset */
#define RCC_APB2RSTSETR_TIM17RST_Pos              (4U)
#define RCC_APB2RSTSETR_TIM17RST_Msk              (0x1U << RCC_APB2RSTSETR_TIM17RST_Pos)             /*!< 0x00000010 */
#define RCC_APB2RSTSETR_TIM17RST                  RCC_APB2RSTSETR_TIM17RST_Msk                       /*!< TIM17 block reset */
#define RCC_APB2RSTSETR_SPI1RST_Pos               (8U)
#define RCC_APB2RSTSETR_SPI1RST_Msk               (0x1U << RCC_APB2RSTSETR_SPI1RST_Pos)              /*!< 0x00000100 */
#define RCC_APB2RSTSETR_SPI1RST                   RCC_APB2RSTSETR_SPI1RST_Msk                        /*!< SPI/I2S1 block reset */
#define RCC_APB2RSTSETR_SPI4RST_Pos               (9U)
#define RCC_APB2RSTSETR_SPI4RST_Msk               (0x1U << RCC_APB2RSTSETR_SPI4RST_Pos)              /*!< 0x00000200 */
#define RCC_APB2RSTSETR_SPI4RST                   RCC_APB2RSTSETR_SPI4RST_Msk                        /*!< SPI4 block reset */
#define RCC_APB2RSTSETR_SPI5RST_Pos               (10U)
#define RCC_APB2RSTSETR_SPI5RST_Msk               (0x1U << RCC_APB2RSTSETR_SPI5RST_Pos)              /*!< 0x00000400 */
#define RCC_APB2RSTSETR_SPI5RST                   RCC_APB2RSTSETR_SPI5RST_Msk                        /*!< SPI5 block reset */
#define RCC_APB2RSTSETR_USART6RST_Pos             (13U)
#define RCC_APB2RSTSETR_USART6RST_Msk             (0x1U << RCC_APB2RSTSETR_USART6RST_Pos)            /*!< 0x00002000 */
#define RCC_APB2RSTSETR_USART6RST                 RCC_APB2RSTSETR_USART6RST_Msk                      /*!< USART6 block reset */
#define RCC_APB2RSTSETR_SAI1RST_Pos               (16U)
#define RCC_APB2RSTSETR_SAI1RST_Msk               (0x1U << RCC_APB2RSTSETR_SAI1RST_Pos)              /*!< 0x00010000 */
#define RCC_APB2RSTSETR_SAI1RST                   RCC_APB2RSTSETR_SAI1RST_Msk                        /*!< SAI1 block reset */
#define RCC_APB2RSTSETR_SAI2RST_Pos               (17U)
#define RCC_APB2RSTSETR_SAI2RST_Msk               (0x1U << RCC_APB2RSTSETR_SAI2RST_Pos)              /*!< 0x00020000 */
#define RCC_APB2RSTSETR_SAI2RST                   RCC_APB2RSTSETR_SAI2RST_Msk                        /*!< SAI2 block reset */
#define RCC_APB2RSTSETR_SAI3RST_Pos               (18U)
#define RCC_APB2RSTSETR_SAI3RST_Msk               (0x1U << RCC_APB2RSTSETR_SAI3RST_Pos)              /*!< 0x00040000 */
#define RCC_APB2RSTSETR_SAI3RST                   RCC_APB2RSTSETR_SAI3RST_Msk                        /*!< SAI3 block reset */
#define RCC_APB2RSTSETR_DFSDMRST_Pos              (20U)
#define RCC_APB2RSTSETR_DFSDMRST_Msk              (0x1U << RCC_APB2RSTSETR_DFSDMRST_Pos)             /*!< 0x00100000 */
#define RCC_APB2RSTSETR_DFSDMRST                  RCC_APB2RSTSETR_DFSDMRST_Msk                       /*!< DFSDM block reset */
#define RCC_APB2RSTSETR_FDCANRST_Pos              (24U)
#define RCC_APB2RSTSETR_FDCANRST_Msk              (0x1U << RCC_APB2RSTSETR_FDCANRST_Pos)             /*!< 0x01000000 */
#define RCC_APB2RSTSETR_FDCANRST                  RCC_APB2RSTSETR_FDCANRST_Msk                       /*!< FDCAN block reset */

/***************  Bit definition for RCC_APB2RSTCLRR register  ****************/
#define RCC_APB2RSTCLRR_TIM1RST_Pos               (0U)
#define RCC_APB2RSTCLRR_TIM1RST_Msk               (0x1U << RCC_APB2RSTCLRR_TIM1RST_Pos)              /*!< 0x00000001 */
#define RCC_APB2RSTCLRR_TIM1RST                   RCC_APB2RSTCLRR_TIM1RST_Msk                        /*!< TIM1 block reset */
#define RCC_APB2RSTCLRR_TIM8RST_Pos               (1U)
#define RCC_APB2RSTCLRR_TIM8RST_Msk               (0x1U << RCC_APB2RSTCLRR_TIM8RST_Pos)              /*!< 0x00000002 */
#define RCC_APB2RSTCLRR_TIM8RST                   RCC_APB2RSTCLRR_TIM8RST_Msk                        /*!< TIM8 block reset */
#define RCC_APB2RSTCLRR_TIM15RST_Pos              (2U)
#define RCC_APB2RSTCLRR_TIM15RST_Msk              (0x1U << RCC_APB2RSTCLRR_TIM15RST_Pos)             /*!< 0x00000004 */
#define RCC_APB2RSTCLRR_TIM15RST                  RCC_APB2RSTCLRR_TIM15RST_Msk                       /*!< TIM15 block reset */
#define RCC_APB2RSTCLRR_TIM16RST_Pos              (3U)
#define RCC_APB2RSTCLRR_TIM16RST_Msk              (0x1U << RCC_APB2RSTCLRR_TIM16RST_Pos)             /*!< 0x00000008 */
#define RCC_APB2RSTCLRR_TIM16RST                  RCC_APB2RSTCLRR_TIM16RST_Msk                       /*!< TIM16 block reset */
#define RCC_APB2RSTCLRR_TIM17RST_Pos              (4U)
#define RCC_APB2RSTCLRR_TIM17RST_Msk              (0x1U << RCC_APB2RSTCLRR_TIM17RST_Pos)             /*!< 0x00000010 */
#define RCC_APB2RSTCLRR_TIM17RST                  RCC_APB2RSTCLRR_TIM17RST_Msk                       /*!< TIM17 block reset */
#define RCC_APB2RSTCLRR_SPI1RST_Pos               (8U)
#define RCC_APB2RSTCLRR_SPI1RST_Msk               (0x1U << RCC_APB2RSTCLRR_SPI1RST_Pos)              /*!< 0x00000100 */
#define RCC_APB2RSTCLRR_SPI1RST                   RCC_APB2RSTCLRR_SPI1RST_Msk                        /*!< SPI/I2S1 block reset */
#define RCC_APB2RSTCLRR_SPI4RST_Pos               (9U)
#define RCC_APB2RSTCLRR_SPI4RST_Msk               (0x1U << RCC_APB2RSTCLRR_SPI4RST_Pos)              /*!< 0x00000200 */
#define RCC_APB2RSTCLRR_SPI4RST                   RCC_APB2RSTCLRR_SPI4RST_Msk                        /*!< SPI4 block reset */
#define RCC_APB2RSTCLRR_SPI5RST_Pos               (10U)
#define RCC_APB2RSTCLRR_SPI5RST_Msk               (0x1U << RCC_APB2RSTCLRR_SPI5RST_Pos)              /*!< 0x00000400 */
#define RCC_APB2RSTCLRR_SPI5RST                   RCC_APB2RSTCLRR_SPI5RST_Msk                        /*!< SPI5 block reset */
#define RCC_APB2RSTCLRR_USART6RST_Pos             (13U)
#define RCC_APB2RSTCLRR_USART6RST_Msk             (0x1U << RCC_APB2RSTCLRR_USART6RST_Pos)            /*!< 0x00002000 */
#define RCC_APB2RSTCLRR_USART6RST                 RCC_APB2RSTCLRR_USART6RST_Msk                      /*!< USART6 block reset */
#define RCC_APB2RSTCLRR_SAI1RST_Pos               (16U)
#define RCC_APB2RSTCLRR_SAI1RST_Msk               (0x1U << RCC_APB2RSTCLRR_SAI1RST_Pos)              /*!< 0x00010000 */
#define RCC_APB2RSTCLRR_SAI1RST                   RCC_APB2RSTCLRR_SAI1RST_Msk                        /*!< SAI1 block reset */
#define RCC_APB2RSTCLRR_SAI2RST_Pos               (17U)
#define RCC_APB2RSTCLRR_SAI2RST_Msk               (0x1U << RCC_APB2RSTCLRR_SAI2RST_Pos)              /*!< 0x00020000 */
#define RCC_APB2RSTCLRR_SAI2RST                   RCC_APB2RSTCLRR_SAI2RST_Msk                        /*!< SAI2 block reset */
#define RCC_APB2RSTCLRR_SAI3RST_Pos               (18U)
#define RCC_APB2RSTCLRR_SAI3RST_Msk               (0x1U << RCC_APB2RSTCLRR_SAI3RST_Pos)              /*!< 0x00040000 */
#define RCC_APB2RSTCLRR_SAI3RST                   RCC_APB2RSTCLRR_SAI3RST_Msk                        /*!< SAI3 block reset */
#define RCC_APB2RSTCLRR_DFSDMRST_Pos              (20U)
#define RCC_APB2RSTCLRR_DFSDMRST_Msk              (0x1U << RCC_APB2RSTCLRR_DFSDMRST_Pos)             /*!< 0x00100000 */
#define RCC_APB2RSTCLRR_DFSDMRST                  RCC_APB2RSTCLRR_DFSDMRST_Msk                       /*!< DFSDM block reset */
#define RCC_APB2RSTCLRR_FDCANRST_Pos              (24U)
#define RCC_APB2RSTCLRR_FDCANRST_Msk              (0x1U << RCC_APB2RSTCLRR_FDCANRST_Pos)             /*!< 0x01000000 */
#define RCC_APB2RSTCLRR_FDCANRST                  RCC_APB2RSTCLRR_FDCANRST_Msk                       /*!< FDCAN block reset */

/***************  Bit definition for RCC_APB3RSTSETR register  ****************/
#define RCC_APB3RSTSETR_LPTIM2RST_Pos             (0U)
#define RCC_APB3RSTSETR_LPTIM2RST_Msk             (0x1U << RCC_APB3RSTSETR_LPTIM2RST_Pos)            /*!< 0x00000001 */
#define RCC_APB3RSTSETR_LPTIM2RST                 RCC_APB3RSTSETR_LPTIM2RST_Msk                      /*!< LPTIM2 block reset */
#define RCC_APB3RSTSETR_LPTIM3RST_Pos             (1U)
#define RCC_APB3RSTSETR_LPTIM3RST_Msk             (0x1U << RCC_APB3RSTSETR_LPTIM3RST_Pos)            /*!< 0x00000002 */
#define RCC_APB3RSTSETR_LPTIM3RST                 RCC_APB3RSTSETR_LPTIM3RST_Msk                      /*!< LPTIM3 block reset */
#define RCC_APB3RSTSETR_LPTIM4RST_Pos             (2U)
#define RCC_APB3RSTSETR_LPTIM4RST_Msk             (0x1U << RCC_APB3RSTSETR_LPTIM4RST_Pos)            /*!< 0x00000004 */
#define RCC_APB3RSTSETR_LPTIM4RST                 RCC_APB3RSTSETR_LPTIM4RST_Msk                      /*!< LPTIM4 block reset */
#define RCC_APB3RSTSETR_LPTIM5RST_Pos             (3U)
#define RCC_APB3RSTSETR_LPTIM5RST_Msk             (0x1U << RCC_APB3RSTSETR_LPTIM5RST_Pos)            /*!< 0x00000008 */
#define RCC_APB3RSTSETR_LPTIM5RST                 RCC_APB3RSTSETR_LPTIM5RST_Msk                      /*!< LPTIM5 block reset */
#define RCC_APB3RSTSETR_SAI4RST_Pos               (8U)
#define RCC_APB3RSTSETR_SAI4RST_Msk               (0x1U << RCC_APB3RSTSETR_SAI4RST_Pos)              /*!< 0x00000100 */
#define RCC_APB3RSTSETR_SAI4RST                   RCC_APB3RSTSETR_SAI4RST_Msk                        /*!< SAI4 block reset */
#define RCC_APB3RSTSETR_SYSCFGRST_Pos             (11U)
#define RCC_APB3RSTSETR_SYSCFGRST_Msk             (0x1U << RCC_APB3RSTSETR_SYSCFGRST_Pos)            /*!< 0x00000800 */
#define RCC_APB3RSTSETR_SYSCFGRST                 RCC_APB3RSTSETR_SYSCFGRST_Msk                      /*!< SYSCFG block reset */
#define RCC_APB3RSTSETR_VREFRST_Pos               (13U)
#define RCC_APB3RSTSETR_VREFRST_Msk               (0x1U << RCC_APB3RSTSETR_VREFRST_Pos)              /*!< 0x00002000 */
#define RCC_APB3RSTSETR_VREFRST                   RCC_APB3RSTSETR_VREFRST_Msk                        /*!< VREF block reset */
#define RCC_APB3RSTSETR_DTSRST_Pos                (16U)
#define RCC_APB3RSTSETR_DTSRST_Msk                (0x1U << RCC_APB3RSTSETR_DTSRST_Pos)               /*!< 0x00010000 */
#define RCC_APB3RSTSETR_DTSRST                    RCC_APB3RSTSETR_DTSRST_Msk                         /*!< DTS block reset */

/***************  Bit definition for RCC_APB3RSTCLRR register  ****************/
#define RCC_APB3RSTCLRR_LPTIM2RST_Pos             (0U)
#define RCC_APB3RSTCLRR_LPTIM2RST_Msk             (0x1U << RCC_APB3RSTCLRR_LPTIM2RST_Pos)            /*!< 0x00000001 */
#define RCC_APB3RSTCLRR_LPTIM2RST                 RCC_APB3RSTCLRR_LPTIM2RST_Msk                      /*!< LPTIM2 block reset */
#define RCC_APB3RSTCLRR_LPTIM3RST_Pos             (1U)
#define RCC_APB3RSTCLRR_LPTIM3RST_Msk             (0x1U << RCC_APB3RSTCLRR_LPTIM3RST_Pos)            /*!< 0x00000002 */
#define RCC_APB3RSTCLRR_LPTIM3RST                 RCC_APB3RSTCLRR_LPTIM3RST_Msk                      /*!< LPTIM3 block reset */
#define RCC_APB3RSTCLRR_LPTIM4RST_Pos             (2U)
#define RCC_APB3RSTCLRR_LPTIM4RST_Msk             (0x1U << RCC_APB3RSTCLRR_LPTIM4RST_Pos)            /*!< 0x00000004 */
#define RCC_APB3RSTCLRR_LPTIM4RST                 RCC_APB3RSTCLRR_LPTIM4RST_Msk                      /*!< LPTIM4 block reset */
#define RCC_APB3RSTCLRR_LPTIM5RST_Pos             (3U)
#define RCC_APB3RSTCLRR_LPTIM5RST_Msk             (0x1U << RCC_APB3RSTCLRR_LPTIM5RST_Pos)            /*!< 0x00000008 */
#define RCC_APB3RSTCLRR_LPTIM5RST                 RCC_APB3RSTCLRR_LPTIM5RST_Msk                      /*!< LPTIM5 block reset */
#define RCC_APB3RSTCLRR_SAI4RST_Pos               (8U)
#define RCC_APB3RSTCLRR_SAI4RST_Msk               (0x1U << RCC_APB3RSTCLRR_SAI4RST_Pos)              /*!< 0x00000100 */
#define RCC_APB3RSTCLRR_SAI4RST                   RCC_APB3RSTCLRR_SAI4RST_Msk                        /*!< SAI4 block reset */
#define RCC_APB3RSTCLRR_SYSCFGRST_Pos             (11U)
#define RCC_APB3RSTCLRR_SYSCFGRST_Msk             (0x1U << RCC_APB3RSTCLRR_SYSCFGRST_Pos)            /*!< 0x00000800 */
#define RCC_APB3RSTCLRR_SYSCFGRST                 RCC_APB3RSTCLRR_SYSCFGRST_Msk                      /*!< SYSCFG block reset */
#define RCC_APB3RSTCLRR_VREFRST_Pos               (13U)
#define RCC_APB3RSTCLRR_VREFRST_Msk               (0x1U << RCC_APB3RSTCLRR_VREFRST_Pos)              /*!< 0x00002000 */
#define RCC_APB3RSTCLRR_VREFRST                   RCC_APB3RSTCLRR_VREFRST_Msk                        /*!< VREF block reset */
#define RCC_APB3RSTCLRR_DTSRST_Pos                (16U)
#define RCC_APB3RSTCLRR_DTSRST_Msk                (0x1U << RCC_APB3RSTCLRR_DTSRST_Pos)               /*!< 0x00010000 */
#define RCC_APB3RSTCLRR_DTSRST                    RCC_APB3RSTCLRR_DTSRST_Msk                         /*!< DTS block reset */

/***************  Bit definition for RCC_AHB2RSTSETR register  ****************/
#define RCC_AHB2RSTSETR_DMA1RST_Pos               (0U)
#define RCC_AHB2RSTSETR_DMA1RST_Msk               (0x1U << RCC_AHB2RSTSETR_DMA1RST_Pos)              /*!< 0x00000001 */
#define RCC_AHB2RSTSETR_DMA1RST                   RCC_AHB2RSTSETR_DMA1RST_Msk                        /*!< DMA1 block reset */
#define RCC_AHB2RSTSETR_DMA2RST_Pos               (1U)
#define RCC_AHB2RSTSETR_DMA2RST_Msk               (0x1U << RCC_AHB2RSTSETR_DMA2RST_Pos)              /*!< 0x00000002 */
#define RCC_AHB2RSTSETR_DMA2RST                   RCC_AHB2RSTSETR_DMA2RST_Msk                        /*!< DMA2 block reset */
#define RCC_AHB2RSTSETR_DMAMUXRST_Pos             (2U)
#define RCC_AHB2RSTSETR_DMAMUXRST_Msk             (0x1U << RCC_AHB2RSTSETR_DMAMUXRST_Pos)            /*!< 0x00000004 */
#define RCC_AHB2RSTSETR_DMAMUXRST                 RCC_AHB2RSTSETR_DMAMUXRST_Msk                      /*!< DMAMUX block reset */
#define RCC_AHB2RSTSETR_ADC12RST_Pos              (5U)
#define RCC_AHB2RSTSETR_ADC12RST_Msk              (0x1U << RCC_AHB2RSTSETR_ADC12RST_Pos)             /*!< 0x00000020 */
#define RCC_AHB2RSTSETR_ADC12RST                  RCC_AHB2RSTSETR_ADC12RST_Msk                       /*!< ADC1&amp;2 block reset */
#define RCC_AHB2RSTSETR_USBORST_Pos               (8U)
#define RCC_AHB2RSTSETR_USBORST_Msk               (0x1U << RCC_AHB2RSTSETR_USBORST_Pos)              /*!< 0x00000100 */
#define RCC_AHB2RSTSETR_USBORST                   RCC_AHB2RSTSETR_USBORST_Msk                        /*!< USBO block reset */
#define RCC_AHB2RSTSETR_SDMMC3RST_Pos             (16U)
#define RCC_AHB2RSTSETR_SDMMC3RST_Msk             (0x1U << RCC_AHB2RSTSETR_SDMMC3RST_Pos)            /*!< 0x00010000 */
#define RCC_AHB2RSTSETR_SDMMC3RST                 RCC_AHB2RSTSETR_SDMMC3RST_Msk                      /*!< SDMMC3 and the SDMMC3 delay (DLYBSD3) block reset */

